OdGeCurve2d.restoreUvCurve(OdGeCurve3d!System.Runtime.CompilerServices.IsConst*,OdGeSurface!System.Runtime.CompilerServices.IsConst*,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Restores a 2D parametric curve on a surface from a 3D curve.
\param curve   [in]  3D curve from which this curve is restored.
\param surface [in]  Surface on which a restored curve lies.
\param tol     [in]  Geometric tolerance.
\returns 2D curve representing the projection of the 3D curve on the
surface.
\remarks
NULL is returned if projection failed.

OdGeCurve2d.getGeomExtents(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*)
\details
Returns bounding box of the whole curve or a part of it. The box is
axis-aligned in the specified local coordinate system. It is guaranteed to
enclose the curve, but not guaranteed to be tight/minimal.
\param range       [in]  The part of the curve to be bounded.
\param coordSystem [in]  The local coordinate system in which box extents are computed.
\remarks
If the range is unbound (e.g. by default), the bounding box of the whole
curve (range can be obtained by the getInterval method) is computed.
Otherwise the bounding box is computed only for the set of points with the
parameter in the specified range. If coordSystem is NULL (e.g. by default),
then bounding box is aligned with global coordinate axes. Otherwise, the box
will be axis-aligned in the local coordinate system specified by the
coordSystem matrix.

OdGeCurve2d.getTrimmedOffset(System.Double,OdArray&lt;OdSharedPtr&lt;OdGeCurve2d&gt;,OdObjectsAllocator&lt;OdSharedPtr&lt;OdGeCurve2d&gt;&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGe.OffsetCrvExtType,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves one or more trimmed offset curves.
\param distance         [in]  Offset distance.
\param offsetCurveList [out]  List that stores offset curves.
\param extensionType    [in]  Determines how the offset curve will be extended at points of C1 discontinuity.
\param tol              [in]  Geometric tolerance.
\remarks
The direction of the positive offset at any point on this curve is along
the tangent to the curve at that point rotated by 90 degrees counterclockwise.
The offsets are trimmed to eliminate self-intersecting loops.
If this curve has discontinuities of type C1 and offset curve is disjoint (e.g., polyline),
then offset curve's parts will be closed with lines or arcs
or they will be extended (depending on extensionType).
By default this function throws the exception "not Implemented". Should be
implemented in derived classes.
Throws:
Exception
eNotImplemented
eInvalidInput

OdGeCurve2d.paramOf(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval!System.Runtime.CompilerServices.IsConst*,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the parameter value of a point.
\param point [in]  Input point on the curve.
\param range [in]  Interval on the curve.
\param tol   [in]  Geometric tolerance.
\remarks
The returned parameters specify a point within tol of point.
In case of uvBox == NULL paramOf(point, tol) is called.
If you are not sure the point is on the curve, use isOn() instead of this
function.
\remarks
By default this function throws the exception "not Implemented". Should be
implemented in derived classes.

OdGeCurve2d.getClosestPointTo(OdGeCurve2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePointOnCurve2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePointOnCurve2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Finds the point on this curve which is the closest to the point of an input
curve.
\param curve2d       [in]  Input curve.
\param pntOnThisCrv [out]  Receives the closest point on this curve.
\param pntOnOtherCrv [in]  A point on the other curve.
\param tol           [in]  Geometric tolerance.
\returns
The closest point of this curve.
\remarks
This function is the same as getClosestPointTo().
By default this function throws the exception "not Implemented". Should be
implemented in derived classes.

OdGeCurve2d.getClosestPointTo(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePointOnCurve2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Finds the closest point on this curve to the input point.
\param point     [in]  Input point.
\param pntOnCrv [out]  Closest point on this curve to the input point.
\param tol       [in]  Geometric tolerance.
\returns
The closest point of this curve.
\remarks
By default this function throws the exception "not Implemented". Should be
implemented in derived classes.

OdGeCurve2d.closestPointTo(OdGeCurve2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Finds the closest point between this curve and the point of an input curve.
\param curve2d        [in]  Input curve.
\param pntOnOtherCrv [out]  Closest point on the input curve.
\param tol            [in]  Geometric tolerance.
\returns
The closest point of this curve.
\remarks
This function is the same as getClosestPointTo().
By default this function throws the exception "not Implemented". Should be
implemented in derived classes.

OdGeCurve2d.closestPointTo(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval!System.Runtime.CompilerServices.IsConst*,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Finds the closest point on this curve to the input point.
\param point  [in]  Point to be evaluated.
\param param [out]  Parameter of closest point.
\param range  [in]  Interval on the curve.
\param tol    [in]  Geometric tolerance.
\returns The closest point on this curve.
\remarks
Native interval is not considered.
If projection of the point does not lie in range-interval, the closest bound
of the interval is returned.
In case of range == NULL closestPointTo(point, param, range, tol) is called where
range is a native curves interval.
An unbounded interval should not be used here.